Revit 2026 API

# IExportContextOnViewBegin Method

---

This method marks the beginning of a 3D view to be exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
RenderNodeAction OnViewBegin(
	ViewNode node
)
```
```vb
Function OnViewBegin (
	node As ViewNode
) As RenderNodeAction
```
```cpp
RenderNodeAction OnViewBegin(
	ViewNode^ node
)
```
```fsharp
abstract OnViewBegin :
        node : ViewNode -> RenderNodeAction
```

#### Parameters

node ViewNode
     Geometry node associated with the view.

#### Return Value

RenderNodeAction Return RenderNodeAction.Skip if you wish to skip exporting this view, or return RenderNodeAction.Proceed otherwise.

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace